tumanako/tumanako-inverter-fw-vehicleControl/src/STM32_sine_interface.cpp
//------------------------------------------------------------------------------
//   TumanakoVC - Electric Vehicle and Motor control software
//   Copyright (C) 2011 Philip Court <philip@greenstage.co.nz>
//
//   This file is part of TumanakoVC.
//
//   TumanakoVC is free software: you can redistribute it and/or modify
//   it under the terms of the GNU Lesser General Public License as published
//   by the Free Software Foundation, either version 3 of the License, or
//   (at your option) any later version.
//
//   TumanakoVC is distributed in the hope that it will be useful,
//   but WITHOUT ANY WARRANTY; without even the implied warranty of
//   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//   GNU Lesser General Public License for more details.
//
//   You should have received a copy of the GNU Lesser General Public License
//   along with TumanakoVC.  If not, see <http://www.gnu.org/licenses/>.
//------------------------------------------------------------------------------

/*******************************************************************************
 * File Name          : STM32_interface.cpp
 * Author             : Philip Court
 * Date First Issued  : 2/Jan/2011
 * Description        : Interfce between Tumanako Vehicle control and Sine Motor
 *                      Control.
 *******************************************************************************
 * History:
 * 02/Jan/2011 v1.0 - PCC: First Cut Sine Motor Control interface
 * 13/Mar/2011 v1.0 - PCC: Dash IO and basic sine motor control working (no contactors)
 ******************************************************************************/

#define STM32F1  //applicable to the STM32F1 series of devices

/* Includes ------------------------------------------------------------------*/
#include "STM32_interface.hpp"
#include "tumanako_global.hpp"

#ifdef TUMANAKO_USE_FILTER
#include "filter/filter.hpp"
#endif

extern "C" {
#include "stm32_sine.h" //interface to sine motor control

#include <libopencm3/stm32/f1/rcc.h>
#include <libopencm3/stm32/f1/gpio.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/stm32/f1/adc.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/stm32/nvic.h>
#include <libopencm3/stm32/f1/scb.h>
#include <libopencm3/stm32/systick.h>
#include <libopencm3/cm3/common.h>  //u8 etc

#define TK_MOTOR_TEMP_SAMPLING_TIME 1999 //(1 sec with 500usec updates)
u16 motorTemp_;  //global to module

s16 calcMotorTemperature(void);

  //variables for Motor Temperature calculation
  static bool b_MT_Is_First_Measurement;
  static u16 hMT_Previous_count;
  static volatile u32 sysTick_;

  //manage global timer interupt
  static volatile u32 TimeBase_;

  void sys_tick_handler() {
    //See also sysTickInit()

    //With a timer configured for 500usec updates this will cycle a u32 once ~ every 24 days
    //(hence using a single u32 for mulitple timers is fine)
    TimeBase_++;
    sysTick_++;

    //Call calcMotorTemperature once every second (1/2 sec?)
    if (sysTick_ >= TK_MOTOR_TEMP_SAMPLING_TIME) {
      sysTick_=0;
      motorTemp_ = calcMotorTemperature();
    }
  }


  //PCC
  //KTY84 linear approximation (degC=A.freq+B) - These constants are x100 to retain accuracy + integer maths performance
  #define TUMANAKO_MT_A -87
  #define TUMANAKO_MT_B 41758  // = 41708 + 50 (for rounding to nearest 1 deg C)

  /*******************************************************************************
  * Function Name  : calcMotorTemperature (PCC)
  * Description    : Compute return latest motor temp. This method is called once
  *                  per second
  * Input          : None
  * Output         : s16
  * Return         : Return motor temp in 1 deg C resolution.
  *******************************************************************************/
  s16 calcMotorTemperature(void)
  {   
    u16 freq_count;  //count pulses from sensor since last read
    u16 hMT_Current_count;
    s16 degC = 0;
   
    // TIM3 is Motor Temp timer counter (it cycles to MAX_UINT)
    hMT_Current_count = TIM3_CNT;
    
    if (!b_MT_Is_First_Measurement)
    {
      freq_count = (hMT_Current_count - hMT_Previous_count -1 );  //Subtract extra 1 to remove LED flash triggers

  // INLINE TESTING for KTY84 constants (uncomment to use)    
  //freq_count = 410 - 65536;  //expect 60 deg C - Result PASS
  //freq_count = 410;  //expect 60 deg C - Result PASS
  //freq_count = 364;  //expect 100 dec C - Result PASS
  //freq_count = 307;  //expect 150 dec C - Result 149 deg C (PASS with acceptable linear approximation error)
  //freq_count = 446;  //expect 30 dec C - Result 29.9 deg C (PASS with acceptable linear approximation error)

      //convert to temperature (degres celcius)
      degC = ((s32)freq_count*TUMANAKO_MT_A + TUMANAKO_MT_B)/100;
      
    } //is first measurement, discard it
    else
    {
      b_MT_Is_First_Measurement = false;
      degC = 0;
    }
    
    hMT_Previous_count = hMT_Current_count;  
    
    return( degC );
  }
}  //end extern "c"

//DIGITAL INPUTS
#define TK_IGN_PIN          GPIO7  //Triggers engagement of contactors (Ignition key on)
#define TK_IGN_PORT         GPIOE
#define TK_START_PIN        GPIO10  //Triggers transition to run mode (Start/Run button pushed)
#define TK_START_PORT       GPIOD
#define TK_CRAWL_PIN        GPIO7  //Triggers motor speed to be held slow
#define TK_CRAWL_PORT       GPIOA
#define TK_FWD_PIN          GPIO11  //Triggers motor to rotate in the forward direction
#define TK_FWD_PORT         GPIOD
#define TK_REV_PIN          GPIO8  //Triggers motor to rotate in reverse
#define TK_REV_PORT         GPIOA

//These pin and port settings clash with the blue led on the board!
#define TK_CONTACTORS_PIN   GPIO7  //Used to read the state of the contactors (TODO not implemented at HW level)
#define TK_CONTACTORS_PORT  GPIOC

#define TK_EMERGENCY_PIN    GPIO8  //Triggers motor speed to be held slo (TODO not implemented at HW level)
#define TK_EMERGENCY_PORT   GPIOC

//DIGITAL OUTPUTS
#define TK_ERROR_LED_PIN    GPIO12  //This output controls the Error LED (Red) on the dashboard
#define TK_ERROR_LED_PORT   GPIOA
#define TK_RUN_LED_PIN      GPIO11  //This output controls the Run LED (Green) on the dashboard
#define TK_RUN_LED_PORT     GPIOA

//#ifdef TUMANAKO_KIWIAC
//Contactor IO (smart card)
//Outputs used to control contactor
#define TK_K_OUT_PORT GPIOB
#define TK_K1_OUT_PIN GPIO8 //precharge (red)
#define TK_K2_OUT_PIN GPIO9 //+ve 750V (yellow)
#define TK_K3_OUT_PIN GPIO10 //-ve 750V (blue)
//brown = ground

//Contactor state feedback
#define TK_K_IN_PORT GPIOC
#define TK_K1_IN_PIN GPIO10 //precharge
#define TK_K2_IN_PIN GPIO11 //+ve 750V
#define TK_K3_IN_PIN GPIO12 //-ve 750V  

//CONSTANTS
#define TK_FILTER_SIZE 20 //increase to make digital signal software more tolerant of noise

STM32Interface::STM32Interface()
#ifdef TUMANAKO_USE_FILTER
    : myFilter_(TK_FILTER_SIZE) //used to filter out noise (to prevent false starting)
#endif
{ }

void STM32Interface::sysTickInit() {
  TimeBase_ = 0;
  sysTick_ = 0;

  // 72MHz / 8 = 9,000,000 counts per second
  //systick_set_clocksource(STK_CTRL_CLKSOURCE_AHB_DIV8);
  // 9000000/9000 = 1000 overflows per second - every 1ms one interrupt
  //systick_set_reload(9000);

  //72MHz = 72,000,000 counts per second
  systick_set_clocksource(STK_CTRL_CLKSOURCE_AHB); //Processor clock, AHB clock(HCLK)
  //Interrupt every 0.5ms
  systick_set_reload(36000);

  systick_counter_enable();

  //PRI 2, SUB_PRI 0
  SCB_SHPR3 &= (u32)0xFF0000; //clear PRI_15 (SysTcik)
  SCB_SHPR3 |= 0x08; //PRI = 2 and SUB PRI =0

  //start counting
  systick_interrupt_enable();
}

//TODO - remove these
unsigned long STM32Interface::getMillisecTimer() {
  return TimeBase_;
}

//TODO - remove these
void STM32Interface::resetMillisecTimer() {
  TimeBase_ = 0;
}

//helper class that allows multiple timers to be created from one TimeBase
MyTimer::MyTimer():myTimeBase_(TimeBase_) {}

