tumanako/tumanako-inverter-fw-vehicleControl/src/STM32_sine_interface.cpp
void MyTimer::reset() {
  myTimeBase_ = TimeBase_;
}

u32 MyTimer::getElapsed() {
  if (TimeBase_ >= myTimeBase_)
    return TimeBase_ - myTimeBase_;
  else  //TimeBase_ has wrapped around (this is unlikely, it takes 24 days with a 500usec timer and a u32 counter)
    return UINT32_MAX - (myTimeBase_- TimeBase_);
  //This section of logic will fail if TimeBase_ does a full cycle (although this would take in excess of 20 days),     //hence the need for the TUMANAKO_MAX_RUNTIME shutdown timer to ensure logical integrity
}

//returns the scaled bus voltage direct from a single digital conversion
unsigned short STM32Interface::getRawScaledBusVolt() {
  //PCC
  //SKAI 1200 0V in = 0V DC Bus, 9V in = 900V DC Bus (10V = 1000V)
  //SKAI 600 0V in = 0V DC Bus, 9V in = 450V DC Bus

  //KiwiAC max = 10 * 3.3/10.1 (99% of full 3.3V scale)
  //(10 * 3.3/10.1) * 32768 = 32444

  //TODO create SI unit object.  All data exposed via these objects
  // si.eu (scaled enginerring units - fixed point and float versions)
  // si.digital (raw digital value)

  //return ((u16)(( (u32)getRawBusVolt() * 1000)/32444));
  return (getRawBusVolt());  //needs scaling
}

//returns the digital bus voltage A/D conversion without SI unit scaling
unsigned short STM32Interface::getRawBusVolt() {
  //return (ADC2_JDR2 >> 3);  //right allignment of injected data register 2
  adc_on(ADC2); // If the ADC_CR2_ON bit is already set -> setting it another time starts the conversion
  while (!(ADC_SR(ADC2) & ADC_SR_EOC)) {};  // Waiting for end of conversion 
  return (ADC_DR(ADC2) & 0xFFF);   // read adc data (needs scalling!!!)
}


// ==== Provide access to various motor control variables ====

unsigned short STM32Interface::getPhaseAOffset() {
  //TODO - part of IFOC
  return 1024;
}
unsigned short STM32Interface::getPhaseBOffset() {
  //TODO - part of IFOC
  return 1024;
}
short STM32Interface::getPhase1() {
  //TODO - part of IFOC
  return 1024;
}
short STM32Interface::getPhase2() {
  //TODO - part of IFOC
  return 1024;
}
short STM32Interface::getPhase3() {
  //TODO - part of IFOC
  return 1024;
}
unsigned long STM32Interface::getRotorTimeConstant() {
  //TODO - part of IFOC
  return 1024;
}
void STM32Interface::setRotorTimeConstant(unsigned long) {
  //TODO - part of IFOC
}
long STM32Interface::getSlipFreq() {
  //TODO - part of IFOC
  return 1024;
}
short STM32Interface::getFluxAngle() {
  //TODO - part of IFOC
  return 1024;
}
short STM32Interface::getElectricalAngle() {
  //TODO - part of IFOC
  return 1024;
}

// ==== IO from the vehcile loom ====

// ==== Physical Inputs ====

bool STM32Interface::getIGN(void) { //Ignition switch on or off?
  return (gpio_get(TK_IGN_PORT, TK_IGN_PIN) == 0);
}

bool STM32Interface::getRAWStart(void) { //the raw digital Start button signal
  return (gpio_get(TK_START_PORT, TK_START_PIN) == 0);
}

bool STM32Interface::getStart(void) { //Start button engaged?
#ifdef TUMANAKO_USE_FILTER
  myFilter_.store(getRAWStart());
  return myFilter_.result();
#else
  return getRAWStart();  //return raw value
#endif
}

bool STM32Interface::getCrawl(void) { //Crawl switch on or off?
  return (gpio_get(TK_CRAWL_PORT, TK_CRAWL_PIN) == 0);
}

bool STM32Interface::getFWD(void) { //Forward selected?
  return (gpio_get(TK_FWD_PORT, TK_FWD_PIN) == 0);
}

bool STM32Interface::getREV(void) { //Reverse selected?
  return (gpio_get(TK_REV_PORT, TK_REV_PIN) == 0);
}

bool STM32Interface::getContactorsEngaged(void) { //Are the contactors engaged (Physical test)?
  return (gpio_get(TK_CONTACTORS_PORT, TK_CONTACTORS_PIN) == 0);
}

bool STM32Interface::getEmergencyStop(void) { //Has the emergency stop been activated?
  return (gpio_get(TK_EMERGENCY_PORT, TK_EMERGENCY_PIN) == 0);
}

// ==== Physical Outputs ====

void STM32Interface::setErrorLED(bool value) { //Show red error light
  if (value == true) gpio_set(TK_ERROR_LED_PORT, TK_ERROR_LED_PIN);
  else gpio_clear(TK_ERROR_LED_PORT, TK_ERROR_LED_PIN);
}

void STM32Interface::setRunLED(bool value) { //Show green run light
  if (value == true) gpio_set(TK_RUN_LED_PORT, TK_RUN_LED_PIN);
  else gpio_clear(TK_RUN_LED_PORT, TK_RUN_LED_PIN);
}

// Reads the value of the specified ADC channel
unsigned short STM32Interface::readADC(unsigned char channel) { //:TODO: needs to be encapsulated into +ve torque and -ve torque etc (channel param not being used!)
  adc_on(ADC1); // If the ADC_CR2_ON bit is already set -> setting it another time starts the conversion
  while (!(ADC_SR(ADC1) & ADC_SR_EOC)) {};  // Waiting for end of conversion 
  return (ADC_DR(ADC1) & 0xFFF);   /* read adc data */
}

void gpioInit() {
#ifdef TUMANAKO_KIWIAC
  AFIO_MAPR |= AFIO_MAPR_TIM1_REMAP_FULL_REMAP;
#endif

  // Set dashboard Run and Error LEDs 'output push-pull'
  gpio_set_mode(TK_ERROR_LED_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_PUSHPULL, TK_ERROR_LED_PIN);
  gpio_set_mode(TK_RUN_LED_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_PUSHPULL, TK_RUN_LED_PIN);

  //Contactor output
  gpio_set_mode(TK_K_OUT_PORT, GPIO_MODE_OUTPUT_2_MHZ,
                GPIO_CNF_OUTPUT_PUSHPULL, TK_K1_OUT_PIN | TK_K2_OUT_PIN | TK_K3_OUT_PIN);

  //Contactor feedback
  gpio_set_mode(TK_K_IN_PORT, GPIO_MODE_INPUT,
                GPIO_CNF_INPUT_PULL_UPDOWN, TK_K1_IN_PIN | TK_K2_IN_PIN | TK_K3_IN_PIN);
  gpio_set(TK_K_IN_PORT, TK_K1_IN_PIN | TK_K2_IN_PIN | TK_K3_IN_PIN);  //make it pull up (reset to make pull down)

  //Contactor feedback (TODO not physically implemented yet)
//  gpio_set_mode(TK_CONTACTORS_PORT, GPIO_MODE_INPUT,
//          GPIO_CNF_INPUT_PULL_UPDOWN, TK_CONTACTORS_PIN);
//  gpio_set(TK_CONTACTORS_PORT, TK_CONTACTORS_PIN);  //make it pull up (reset to make pull down)

  //FWD
  gpio_set_mode(TK_FWD_PORT, GPIO_MODE_INPUT,
                GPIO_CNF_INPUT_PULL_UPDOWN, TK_FWD_PIN);
  gpio_set(TK_FWD_PORT, TK_FWD_PIN);  //make it pull up (reset to make pull down)

  //REV
  gpio_set_mode(TK_REV_PORT, GPIO_MODE_INPUT,
                GPIO_CNF_INPUT_PULL_UPDOWN, TK_REV_PIN);
  gpio_set(TK_REV_PORT, TK_REV_PIN);  //make it pull up (reset to make pull down)

  //Crawl
  gpio_set_mode(TK_CRAWL_PORT, GPIO_MODE_INPUT,
                GPIO_CNF_INPUT_PULL_UPDOWN, TK_CRAWL_PIN);
  gpio_set(TK_CRAWL_PORT, TK_CRAWL_PIN);  //make it pull up (reset to make pull down)

  //Start
  gpio_set_mode(TK_START_PORT, GPIO_MODE_INPUT,
                GPIO_CNF_INPUT_PULL_UPDOWN, TK_START_PIN);
  gpio_set(TK_START_PORT, TK_START_PIN);  //make it pull up (reset to make pull down)

