tumanako/tumanako-inverter-fw-vehicleControl/src/STM32_sine_interface.cpp
}

void STM32Interface::adc_setup(u32 adc_port) {
  switch (adc_port) {
     case ADC1:  rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_ADC1EN);
        break;
     case ADC2:  rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_ADC2EN);
        break;
     case ADC3:  rcc_peripheral_enable_clock(&RCC_APB2ENR, RCC_APB2ENR_ADC3EN);
        break;
     default: shutdownPower();  while(1) {};  //TODO log something (should never happen)
        break;
  }

  /* make sure it didnt run during config */
  adc_off(adc_port);

  /* we configure everything for one single conversion */
  adc_disable_scan_mode(adc_port);
  adc_set_single_conversion_mode(adc_port);
  adc_enable_discontinous_mode_regular(adc_port);
  adc_disable_external_trigger_regular(adc_port);
  adc_set_right_aligned(adc_port);
  /* we want read out the temperature sensor so we have to enable it */
  adc_enable_temperature_sensor(adc_port);
  adc_set_conversion_time_on_all_channels(adc_port, ADC_SMPR_SMP_28DOT5CYC);

  adc_on(adc_port);
  /* wait for adc starting up*/
  for (volatile int i = 0; i < 80000; i++) {}; // wait (volitile removes need for -O0 CFLAGS). */

  adc_reset_calibration(adc_port);
  adc_calibration(adc_port);
}

//TODO this has been copied and pasted from sine code (tidy up!)
u8 STM32Interface::adcchfromport(int command_port, int command_bit) {
  /*
   PA0 ADC12_IN0
   PA1 ADC12_IN1
   PA2 ADC12_IN2
   PA3 ADC12_IN3 - Bus Voltage
   PA4 ADC12_IN4
   PA5 ADC12_IN5
   PA6 ADC12_IN6
   PA7 ADC12_IN7
   PB0 ADC12_IN8
   PB1 ADC12_IN9
   PC0 ADC12_IN10
   PC1 ADC12_IN11
   PC2 ADC12_IN12
   PC3 ADC12_IN13
   PC4 ADC12_IN14 - Accellerator POT input
   PC5 ADC12_IN15
   temp ADC12_IN16
   */
  switch (command_port) {
  case 0: /* port A */
    if (command_bit<8) return command_bit;
    break;
  case 1: /* port B */
    if (command_bit<2) return command_bit+8;
    break;
  case 2: /* port C */
    if (command_bit<6) return command_bit+10;
    break;
  }
  return 16;
}


//Setup hardware to read temperature data (input as a freq on PC8)
void motorTemperatureInit() {

  //ENABLE TIM3 full remap (PC8 on chnl 3)
  AFIO_MAPR |= AFIO_MAPR_TIM3_REMAP_FULL_REMAP;

  //TIM3 clock source enable
  RCC_APB1ENR |= RCC_APB1ENR_TIM3EN;

  //Enable GPIOC clock
  RCC_APB2ENR |= RCC_APB2ENR_IOPCEN;

  //Set GPIOC Pin 8 as input floating (motor temperature - freq maps to temperature)
  gpio_set_mode(
      GPIOC,
      GPIO_MODE_INPUT,
      GPIO_CNF_INPUT_FLOAT,
      GPIO8);

  //TIM3 Prescaler = 0  i.e. No prescaling 
  TIM3_PSC = 0x0;
  //TIM3 Counter Mode Up;   
  timer_set_alignment(TIM3, TIM_CR1_CMS_EDGE);
  //TIM3 Period = 65535
  TIM3_ARR = 65535;
  //TIM3 clock division 1
  timer_set_clock_division(TIM3, TIM_CR1_CKD_CK_INT);
 
  //(CC1 input, IC1 mapped onto TI1) and OC1Ref is cleared when High detected on ETRF input
  TIM3_CCMR1 |= 0x04 | 0x01;
  TIM3_CR2 |= 0x0080;  //Set TI1S (CH1, CH2 and CH3 are connected to the TI1 input (XOR)
  TIM3_SMCR = 0x50 | 0x07; //TI1FR1 (b101) and SMS = external clock /mode 1
  TIM3_SR = ~((u16)0x0001); //Clear Update interupt flag (UIF)
  TIM3_DIER |= 0x0001; //IT update (UIE - update interupt enable)
  TIM3_CNT = 0;   //Clear counter
  TIM3_CR1 |= TIM_CR1_CEN;  //Finally, enable it!
}

/** Used to init the Motor Control libraries*/
int STM32Interface::init(void) {
  b_MT_Is_First_Measurement = true;  //used by calcMotorTemperature
  hMT_Previous_count = 0;  //used by calcMotorTemperature

  //TODO need to consolidate all hardware setup into a single place so Tumanako modules do not conflict
  STM32_SINE_Init();  //can cause conflicts

  sysTickInit();
  gpioInit();

  motorTemperatureInit();

  //analogue init
  static u8 channel_array[16] = {16,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
  static u8 channel_array_volt[16] = {16,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};

  //clock_setup(); this is done in the main
  adc_setup(ADC1);

  gpio_set_mode(GPIOC, GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, GPIO4);
  channel_array[0] = adcchfromport(2,4); //2=C
  adc_set_regular_sequence(ADC1, 1, channel_array);

  //Setup DC Bus volt analogue (on ADC2) - TODO will need to utilise the ADC more effectively with IFOC
  adc_setup(ADC2);
  gpio_set_mode(GPIOA, GPIO_MODE_INPUT, GPIO_CNF_INPUT_ANALOG, GPIO3);
  channel_array_volt[0] = adcchfromport(0,3); //0=A
  adc_set_regular_sequence(ADC2, 1, channel_array_volt);

  return 0;
}

// Getter/Setters for the current torque setting (Iq)
signed short STM32Interface::getTorque(void) { //read current value of Torque
  //WARNING this is temp code (motor control for stm32_sine is in tim1_up_isr)
  return STM32_SINE_SineSpeed;  //TODO - add some speed to torque type logic here
}

void STM32Interface::setTorque(signed short torque) { //Set the target Torque value (used in torque control algorithm)
  //WARNING this is temp code (motor control for stm32_sine is in tim1_up_isr)
  STM32_SINE_SineSpeed =  10*torque;  //TODO - add some torque to speed type logic here
}

// Getter/Setters for the current torque setting (Iq)
signed short STM32Interface::getSpeed(void) { //read current value of Torque
  //TODO
  return 1024;
}
void STM32Interface::setSpeed(signed short) { //Set the target Torque value (used in torque control algorithm)
  //TODO
}

// Getter/Setters for the current flux setting (Id)
signed short STM32Interface::getFlux(void) { //read current value of rotor Flux
  //TODO
  return 1024;
}
void STM32Interface::setFlux(signed short) { //Set the target rotor Flux value (used in torque control algorithm)
  //TODO
}

// Getter/Setters for the current speed (RPM) setting
signed short STM32Interface::getRPM(void) { //read current value of motor RPM
  //TODO
  return 1024;
}
void STM32Interface::setRPM(signed short) { //Set the target RPM (speed control loop only)
  //TODO
}

//Is the bus voltage OK? (TODO - more work needed here.  Must expose limits etc...)
bool STM32Interface::busVoltageOK(void) {
  unsigned short busVolt = getRawScaledBusVolt();

  //  check bus over voltage
  if ((busVolt >= TUMANAKO_PRECHARGE_V) && (busVolt <= TUMANAKO_MAX_BUX_V ))
    return true;
  else
    return true;
}

//Get current bus voltage (via a historical 16 reading average)
short STM32Interface::busVoltage(void) {
  return getRawScaledBusVolt();
}

//Get current temperature from power stage
short STM32Interface::powerStageTemperature(void) {
  //TODO
  return 1024;
}

