tumanako/tumanako-inverter-fw-vehicleControl/src/STM32_sine_interface.cpp
short STM32Interface::motorTemperature(void) {
  return motorTemp_;
}


//returns 0 if no issues
short STM32Interface::testVariousMotorParam(void) {
  unsigned short busVolt = getRawScaledBusVolt();

  //TODO make enum

  //  check over temperature of power stage
  if (false) { //TODO
    return 1; //OVERHEAT;
  }

  //  check bus over voltage
  if (busVolt > TUMANAKO_MAX_BUX_V ) {
    return 2; //OVER_VOLTAGE
  }

#ifdef TUMANAKO_UNDERVOLTAGE_TEST
  //  check bus under voltage
  if (busVolt < TUMANAKO_PRECHARGE_V) //should never go below precharge min voltage
#else
  if (false)  //dont test undervoltage
#endif
  {
    return 3; //UNDER_VOLTAGE
  }
  return 0; //All OK
}

//Contactor controls (See diagram here: http://liionbms.com/php/precharge.php)
bool STM32Interface::getK1() {
  return (gpio_get(TK_K_IN_PORT, TK_K1_IN_PIN) == 0);
}

bool STM32Interface::getK2() {
  return (gpio_get(TK_K_IN_PORT, TK_K2_IN_PIN) == 0);
}

bool STM32Interface::getK3() {
  return (gpio_get(TK_K_IN_PORT, TK_K3_IN_PIN) == 0);
}

void STM32Interface::setK1(bool status) {
  if (status == true) gpio_set(TK_K_OUT_PORT, TK_K1_OUT_PIN);
  else gpio_clear(TK_K_OUT_PORT, TK_K1_OUT_PIN);
}

void STM32Interface::setK2(bool status) {
  if (status == true) gpio_set(TK_K_OUT_PORT, TK_K2_OUT_PIN);
  else gpio_clear(TK_K_OUT_PORT, TK_K2_OUT_PIN);
}

void STM32Interface::setK3(bool status) {
  if (status == true) gpio_set(TK_K_OUT_PORT, TK_K3_OUT_PIN);
  else gpio_clear(TK_K_OUT_PORT, TK_K3_OUT_PIN);
}

//Blocking Wait. Wait specified number of milliseconds (ms)
void STM32Interface::wait(unsigned short time) {
  MyTimer timer;
  u32 waitTime = time;

  while (timer.getElapsed() < waitTime) { //wait NOP
    asm(
      "mov     r0, r0\n\t"
      "mov     r0, r0\n\t"
      "mov     r0, r0\n\t"
      "mov     r0, r0"
    );
  }
}

//Sanity checks (TODO paramatise this)
void STM32Interface::checkPowerStageLimits() {
  //TODO
}

//Prep motor for start (TODO document details)
void STM32Interface::motorInit() {
  //TODO
}

//Start motor
void STM32Interface::motorStart() {
  TIM1_BDTR |= TIM_BDTR_MOE; //enable TIM1 main outputs

  //Check motor starts and rotation occurs when reasonable torque is applied
#ifdef DONT_INCLUDE
  if (speed != 0) {
    // turn LED off to show startup time has succeeded?
  }
  //shutdown power if torque figure is large enough to be concerned at lack of rotation (after suitable wait)
  else if ((torqueRef > STM_STALL_TORQUE_LIMIT) || (torqueRef < -STM_STALL_TORQUE_LIMIT)) {
    // turn LED on to show startup time has expired and torque figure > than threshold
    if (startTimeElapsed()) {
      //Go to fault, reason is speed feedback
    }
  } else //Reset the startup timer (because the torque applied is low)
#endif
  }

//test to be executed in the main loop when motor is running (TODO document details)
void STM32Interface::motorTestForSpeedError() {
  //TODO see motorStart logic
}

//Shutdown motor control and power stage
void STM32Interface::shutdownPower() {
  //Disable the PWM main outputs
  TIM1_BDTR &= (uint16_t)~(TIM_BDTR_MOE); //main output enable OFF

  //Explicitly disconnect contactors
  setK1(false);
  setK2(false);
  setK3(false);
}


